




let PhysiscsThemes = {
    isCurrentPageNav: 1,
    Themes: [
    {name:'classical mechanics', subtopics: 
    [{topicName: 'Conservation laws', backgroundImg:'https://i.pinimg.com/564x/ff/55/c6/ff55c6d258be86fb0b0ed9718f704ae4.jpg'
    ,subtopicText:[
        {id: 0, Title:'Зако́ны сохране́ния', parText:'Зако́ны сохране́ния — фундаментальные физические законы, согласно которым при определённых условиях некоторые измеримые физические величины, характеризующие замкнутую физическую систему, не изменяются с течением времени. Являются наиболее общими законами в любой физической теории. Имеют большое эвристическое значение.'},
        {id: 1, Title:'Законы Сохранения Энергии', parText:'Зако́н сохране́ния эне́ргии — фундаментальный закон природы, установленный эмпирически и заключающийся в том, что для изолированной физической системы может быть введена скалярная физическая величина, являющаяся функцией параметров системы и называемая энергией, которая сохраняется с течением времени. Эта энергия может быть представлена в виде комбинации разных форм, таких как механическая, тепловая, электромагнитная, ядерная и других, для различных систем, таких как элементарные частицы, макроскопические тела, звёзды и галактики, но оставаться неизменной универсальной сохраняющейся величиной. Видимое нарушение закона сохранения энергии требует рассматривать альтернативные объяснения.'},
        {id: 2, Title:'', parText:'В ньютоновской механике формулируется частный случай закона сохранения энергии — Закон сохранения механической энергии, звучащий следующим образом:'},
        {id: 3, Title:'', parText:'Полная механическая энергия замкнутой системы тел, между которыми действуют только консервативные силы, остаётся постоянной.'},
        {id: 4, Title:'', parText:'Проще говоря, при отсутствии диссипативных сил (например, сил трения) механическая энергия не возникает из ничего и не может исчезнуть в никуда.'},
        {id: 5, Title:'Зако́н сохране́ния и́мпульса', parText:'Зако́н сохране́ния и́мпульса (зако́н сохране́ния количества движения) — закон, утверждающий, что сумма импульсов всех тел системы есть величина постоянная, если векторная сумма внешних сил, действующих на систему тел, равна нулю.'},
        {id: 6, Title:'', parText:'В классической механике закон сохранения импульса обычно выводится как следствие законов Ньютона. Из законов Ньютона можно показать, что при движении системы в пустом пространстве импульс сохраняется во времени, а при наличии внешнего воздействия скорость изменения импульса определяется суммой приложенных сил. Соответственно, при равнобежности (параллельном переносе) в пространстве тел замкнутой системы физические свойства последней не меняются.Как и любой из фундаментальных законов сохранения, закон сохранения импульса связан, согласно теореме Нётер, с одной из фундаментальных симметрий, — однородностью пространства.Закон сохранения импульса впервые был сформулирован Р. Декартом.'},
        {id: 7, Title:'', parText:'То есть суммарный импульс системы из N частиц является постоянной величиной. При N = 1 получаем выражение для случая одной частицы. Таким образом, следует вывод:'},
        {id: 8, Title:'', parText:'Если векторная сумма всех внешних сил, действующих на систему, равна нулю, то импульс системы сохраняется, то есть не меняется со временем.'},
    ]
    }, {topicName: 'dynamics', backgroundImg:'https://i.pinimg.com/564x/ff/55/c6/ff55c6d258be86fb0b0ed9718f704ae4.jpg'
    ,subtopicText:[
        {id: 0, Title:'Дина́мика', parText:'раздел механики, в котором изучаются причины изменения механического движения, тогда как способы описать движение изучает кинематика. В классической механике этими причинами являются силы. Динамика оперирует также такими понятиями, как масса, импульс, момент импульса, энергия.'},
        {id: 1, Title:'Законы Сохранения Энергии', parText:'Динамика, базирующаяся на законах Ньютона, называется классической динамикой. Классическая динамика описывает движения объектов со скоростями от долей миллиметров в секунду до километров в секунду.'},
        {id: 2, Title:'', parText:'Однако эти методы перестают быть справедливыми для движения объектов очень малых размеров'},
        {id: 3, Title:'', parText:'(см. квантовая механика)'},
        {id: 4, Title:'', parText:' и при движениях со скоростями, близкими к скорости света'},
        {id: 5, Title:'', parText:' (см. релятивистская механика)'},
        {id: 6, Title:'', parText:'. Такие движения подчиняются другим законам.'},
        {id: 7, Title:'', parText:'Исторически деление на прямую и обратную задачу динамики сложилось следующим образом[3].'},
        {id: 8, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 9, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 10, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 11, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 12, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 13, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
        {id: 14, Title:'', parText:'Прямая задача динамики: по заданному характеру движения определить равнодействующую сил, действующих на тело.'},
    ]
    }, {topicName: 'fluctuations', backgroundImg:'https://i.pinimg.com/564x/ff/55/c6/ff55c6d258be86fb0b0ed9718f704ae4.jpg'
    ,subtopicText:[
        {id: 0, Title:'Зако́ны сохране́ния', parText:'Зако́ны сохране́ния — фундаментальные физические законы, согласно которым при определённых условиях некоторые измеримые физические величины, характеризующие замкнутую физическую систему, не изменяются с течением времени. Являются наиболее общими законами в любой физической теории. Имеют большое эвристическое значение.'},
        {id: 1, Title:'Законы Сохранения Энергии', parText:'Зако́н сохране́ния эне́ргии — фундаментальный закон природы, установленный эмпирически и заключающийся в том, что для изолированной физической системы может быть введена скалярная физическая величина, являющаяся функцией параметров системы и называемая энергией, которая сохраняется с течением времени. Эта энергия может быть представлена в виде комбинации разных форм, таких как механическая, тепловая, электромагнитная, ядерная и других, для различных систем, таких как элементарные частицы, макроскопические тела, звёзды и галактики, но оставаться неизменной универсальной сохраняющейся величиной. Видимое нарушение закона сохранения энергии требует рассматривать альтернативные объяснения.'},
        {id: 2, Title:'', parText:'В ньютоновской механике формулируется частный случай закона сохранения энергии — Закон сохранения механической энергии, звучащий следующим образом:'},
        {id: 3, Title:'', parText:'Полная механическая энергия замкнутой системы тел, между которыми действуют только консервативные силы, остаётся постоянной.'},
        {id: 4, Title:'', parText:'Проще говоря, при отсутствии диссипативных сил (например, сил трения) механическая энергия не возникает из ничего и не может исчезнуть в никуда.'},
        {id: 5, Title:'Зако́н сохране́ния и́мпульса', parText:'Зако́н сохране́ния и́мпульса (зако́н сохране́ния количества движения) — закон, утверждающий, что сумма импульсов всех тел системы есть величина постоянная, если векторная сумма внешних сил, действующих на систему тел, равна нулю.'},
        {id: 6, Title:'', parText:'В классической механике закон сохранения импульса обычно выводится как следствие законов Ньютона. Из законов Ньютона можно показать, что при движении системы в пустом пространстве импульс сохраняется во времени, а при наличии внешнего воздействия скорость изменения импульса определяется суммой приложенных сил. Соответственно, при равнобежности (параллельном переносе) в пространстве тел замкнутой системы физические свойства последней не меняются.Как и любой из фундаментальных законов сохранения, закон сохранения импульса связан, согласно теореме Нётер, с одной из фундаментальных симметрий, — однородностью пространства.Закон сохранения импульса впервые был сформулирован Р. Декартом.'},
        {id: 7, Title:'', parText:'То есть суммарный импульс системы из N частиц является постоянной величиной. При N = 1 получаем выражение для случая одной частицы. Таким образом, следует вывод:'},
        {id: 8, Title:'', parText:'Если векторная сумма всех внешних сил, действующих на систему, равна нулю, то импульс системы сохраняется, то есть не меняется со временем.'},
    ]
    }, {topicName: 'Ballistics', backgroundImg:'https://i.pinimg.com/564x/ff/55/c6/ff55c6d258be86fb0b0ed9718f704ae4.jpg'
    ,subtopicText:[
        {id: 0, Title:'Зако́ны сохране́ния', parText:'Зако́ны сохране́ния — фундаментальные физические законы, согласно которым при определённых условиях некоторые измеримые физические величины, характеризующие замкнутую физическую систему, не изменяются с течением времени. Являются наиболее общими законами в любой физической теории. Имеют большое эвристическое значение.'},
        {id: 1, Title:'Законы Сохранения Энергии', parText:'Зако́н сохране́ния эне́ргии — фундаментальный закон природы, установленный эмпирически и заключающийся в том, что для изолированной физической системы может быть введена скалярная физическая величина, являющаяся функцией параметров системы и называемая энергией, которая сохраняется с течением времени. Эта энергия может быть представлена в виде комбинации разных форм, таких как механическая, тепловая, электромагнитная, ядерная и других, для различных систем, таких как элементарные частицы, макроскопические тела, звёзды и галактики, но оставаться неизменной универсальной сохраняющейся величиной. Видимое нарушение закона сохранения энергии требует рассматривать альтернативные объяснения.'},
        {id: 2, Title:'', parText:'В ньютоновской механике формулируется частный случай закона сохранения энергии — Закон сохранения механической энергии, звучащий следующим образом:'},
        {id: 3, Title:'', parText:'Полная механическая энергия замкнутой системы тел, между которыми действуют только консервативные силы, остаётся постоянной.'},
        {id: 4, Title:'', parText:'Проще говоря, при отсутствии диссипативных сил (например, сил трения) механическая энергия не возникает из ничего и не может исчезнуть в никуда.'},
        {id: 5, Title:'Зако́н сохране́ния и́мпульса', parText:'Зако́н сохране́ния и́мпульса (зако́н сохране́ния количества движения) — закон, утверждающий, что сумма импульсов всех тел системы есть величина постоянная, если векторная сумма внешних сил, действующих на систему тел, равна нулю.'},
        {id: 6, Title:'', parText:'В классической механике закон сохранения импульса обычно выводится как следствие законов Ньютона. Из законов Ньютона можно показать, что при движении системы в пустом пространстве импульс сохраняется во времени, а при наличии внешнего воздействия скорость изменения импульса определяется суммой приложенных сил. Соответственно, при равнобежности (параллельном переносе) в пространстве тел замкнутой системы физические свойства последней не меняются.Как и любой из фундаментальных законов сохранения, закон сохранения импульса связан, согласно теореме Нётер, с одной из фундаментальных симметрий, — однородностью пространства.Закон сохранения импульса впервые был сформулирован Р. Декартом.'},
        {id: 7, Title:'', parText:'То есть суммарный импульс системы из N частиц является постоянной величиной. При N = 1 получаем выражение для случая одной частицы. Таким образом, следует вывод:'},
        {id: 8, Title:'', parText:'Если векторная сумма всех внешних сил, действующих на систему, равна нулю, то импульс системы сохраняется, то есть не меняется со временем.'},
    ]
    }
    ]},
    {name:'Electrodynamics', subtopics: 
    [{topicName: 'electromagnetic induction', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: 'magnetism', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: 'electrostatics', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }]},
    {name:'nuclear physics', subtopics: 
    [{topicName: 'Manhatten Project', backgroundImg:'https://i.pinimg.com/564x/40/03/f2/4003f230bd7e303ad4d898f800b49a65.jpg'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: 'Atom concept', backgroundImg:'https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Helium_atom_QM.svg/300px-Helium_atom_QM.svg.png'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: '', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }]},
    {name:'molecular kinetic theory', subtopics: 
    [{topicName: 'Gas isoprocesses', backgroundImg:'https://i.pinimg.com/564x/ff/55/c6/ff55c6d258be86fb0b0ed9718f704ae4.jpg'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: '', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: '', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }]},
    {name:'Optics', subtopics: 
    [{topicName: 'Lenses', backgroundImg:'https://www.physicsclassroom.com/Class/refrn/u14l5a1.gif'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: 'Lasers', backgroundImg:'https://assets.newatlas.com/dims4/default/ef91db4/2147483647/strip/true/crop/1505x1003+98+0/resize/1200x800!/quality/90/?url=http%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2Farchive%2Flaser-nobel-2.jpg'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: '', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }]},
    {name:'Astronomy', subtopics: 
    [{topicName: 'Stellar astronomy', backgroundImg:'https://in-space.ru/wp-content/uploads/2016/06/9.jpg'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: 'Solar system', backgroundImg:'https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Solar_System_true_color.jpg/440px-Solar_System_true_color.jpg'
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }, {topicName: '', backgroundImg:''
    ,subtopicText:[
        {id: 0, Title:'', parText:''},
        {id: 1, Title:'', parText:''},
        {id: 2, Title:'', parText:''}
    ]
    }]},
    ],
    CurrentTheme: 0,
    CurrentSubtopics: ''
}








const PhysicsThemesReducer = (state = PhysiscsThemes, action) => {
    switch(action.type) {
        case CURRENT_IS_NAV:
            debugger
            return {
                ...state,
                isCurrentPageNav: 1
            }
        case CURRENT_ISNT_NAV: 
        debugger
            return {
                ...state,
                isCurrentPageNav:0
            }
        case SET_CURRENT_THEME: 
            return {
                ...state,
                CurrentTheme: action.CurrentTheme
            }
        case SET_CURRENT_SUBTOPICS: 
        debugger;
            return {
                ...state,
                CurrentSubtopics: action.CurrentSubtopics
            }
        default: return state
    }
}


const CURRENT_IS_NAV = "CurrentIsNav"
const CURRENT_ISNT_NAV = "CurrentIsntNav"
const SET_CURRENT_THEME = 'SetCurrentTheme'
const SET_CURRENT_SUBTOPICS = 'SetCurrentSubtopics'

export const ChangeCurrentPageToNav = () =>({type:CURRENT_IS_NAV})
export const ChangeCurrentPageToOther = () =>({type:CURRENT_ISNT_NAV})
export const SetCurrentTheme = (CurrentTheme) => ({type:SET_CURRENT_THEME, CurrentTheme})
export const SetCurrentSubtopics = (CurrentSubtopics) => ({type: SET_CURRENT_SUBTOPICS, CurrentSubtopics})

export default PhysicsThemesReducer;